import java.util.regex

import scala.util.matching.Regex

//val st = "{'用户id': 'xiechangliu', '已读书id': ['2133254', '1346815', '2133254', '1830378', '2209098', '1770782', '2243213', '2081058', '3418469', '3071759', '3270898', '2150352', '2280027', '2973228', '1914636', '2340237', '1089517', '1221329', '1220219', '2979779', '2996596', '3776157', '2359212', '3890174', '3646172', '2382359', '1867064', '4009552', '1076654', '1291352', '1958227', '1440345', '10598170', '1088423', '3146656', '2277795', '1478890']}"
//val s = st.split(":")
//val s1=s(1).split(",")(0).split("'")(1)
//val s2=new Regex("(\\[[^\\]]*\\])").findAllIn(st).mkString("").toString()
//val s3 =s2.replace("'","").replaceAll("\\[","").replaceAll("]","")
//val s4=s1+"|"+s3
val st = "{'图书id': '10598170', '图书名称': '我不要你死于一事无成', '图书作者': '章忠建', '图书封面': 'https://img3.doubanio.com/view/subject/l/public/s10245631.jpg', '图书标签': ['《我不要你死于一事无成：给女儿的17封告别信》', '阿富汗', '女性', '励志', '传记', '法齐娅•库菲的自传', '外国文学', '自传']}"
val s = st.split(":")
val s1=s(1).split(",")(0).split("'")(1)
val s2=s(2).split(",")(0).split("'")(1)